==================
Function definition with no parameters
==================

main = fn() i32 {
    42
}

---

(source_file
    (statement
          (variable_definition
              pattern: (pattern_expression
                  (identifier))
              value: (expression
                  (function_definition
                      return_type: (expression
                          (identifier))
                      body: (block
                          (statement
                              (expression
                                  (integer_literal)))))))))

==================
Function definition with one parameter
==================

id = fn(x: i32) i32 {
    x
}

---

(source_file
    (statement
          (variable_definition
              pattern: (pattern_expression
                  (identifier))
              value: (expression
                  (function_definition
                      parameters: (function_parameters
                          (function_parameter
                              pattern: (pattern_expression
                                  (identifier))
                              type: (expression
                                  (identifier))))
                      return_type: (expression
                          (identifier))
                      body: (block
                          (statement
                              (expression
                                  (identifier)))))))))

==================
Function definition with two params
==================

add = fn(x: i32, y: i32) i32 {
    x + y
}

---

(source_file
    (statement
        (variable_definition
          pattern: (pattern_expression
              (identifier))
          value: (expression
            (function_definition
                parameters: (function_parameters
                    (function_parameter
                        pattern: (pattern_expression
                            (identifier))
                        type: (expression
                            (identifier)))
                    (function_parameter
                        pattern: (pattern_expression
                            (identifier))
                        type: (expression
                            (identifier))))
                return_type: (expression
                    (identifier))
                body: (block
                    (statement
                        (expression
                            (binary_operation
                                left: (expression
                                    (identifier))
                                operator: (add)
                                right: (expression
                                    (identifier)))))))))))

==================
Generic function definition with one type parameter
==================

id = fn(T: type, x: T) T {
    x
}

---

(source_file
  (statement
      (variable_definition
          pattern: (pattern_expression
              (identifier))
          value: (expression
              (function_definition
                  parameters: (function_parameters
                      (function_parameter
                          pattern: (pattern_expression
                              (identifier))
                          type: (expression
                              (identifier)))
                      (function_parameter
                          pattern: (pattern_expression
                              (identifier))
                          type: (expression
                              (identifier))))
                  return_type: (expression
                      (identifier))
                  body: (block
                      (statement
                          (expression
                              (identifier)))))))))


==================
Function definition with multiple line body
==================

sum_of_squares = fn(x: i32, y: i32) i32 {
    x2 = x * x
    y2 = y * y
    x2 + y2
}

---

(source_file
    (statement
      (variable_definition
        pattern: (pattern_expression
            (identifier))
        value: (expression
          (function_definition
              parameters: (function_parameters
                  (function_parameter
                      pattern: (pattern_expression
                          (identifier))
                      type: (expression
                          (identifier)))
                  (function_parameter
                      pattern: (pattern_expression
                          (identifier))
                      type: (expression
                          (identifier))))
              return_type: (expression
                  (identifier))
              body: (block
                  (statement
                        (variable_definition
                            pattern: (pattern_expression
                                (identifier))
                            value: (expression
                                (binary_operation
                                    left: (expression
                                        (identifier))
                                    operator: (multiply)
                                    right: (expression
                                        (identifier))))))
                  (statement
                      (variable_definition
                          pattern: (pattern_expression
                              (identifier))
                          value: (expression
                              (binary_operation
                                  left: (expression
                                      (identifier))
                                  operator: (multiply)
                                  right: (expression
                                      (identifier))))))
                  (statement
                    (expression
                        (binary_operation
                            left: (expression
                                (identifier))
                            operator: (add)
                            right: (expression
                                (identifier)))))))))))


==================
Function call with no args
==================

main()

---

(source_file
    (statement
      (expression
        (function_call
          function: (expression
            (identifier))))))

==================
Function call with one argument
==================

id(42)

---

(source_file
    (statement
      (expression
        (function_call
          function: (expression
            (identifier))
          arguments: (function_arguments
            (expression
              (integer_literal)))))))

==================
Function call with two args
==================

add(5, 3)

---

(source_file
    (statement
      (expression
        (function_call
          function: (expression
            (identifier))
          arguments: (function_arguments
            (expression
              (integer_literal))
            (expression
              (integer_literal)))))))


==================
Function call with trailing comma
==================

add(5, 3,)

---

(source_file
    (statement
      (expression
        (function_call
          function: (expression
            (identifier))
          arguments: (function_arguments
            (expression
              (integer_literal))
            (expression
              (integer_literal)))))))
