==================
Function definition with no params
==================

main = fn() -> i32 {
    42
}

---

(source_file
    (expr
        (def
            name: (symbol)
            value: (expr
                (fn
                    return_type: (expr
                        (symbol))
                    body: (block
                        (expr
                            (int))))))))

==================
Function definition with one parameter
==================

id = fn(x: i32) -> i32 {
    x
}

---

(source_file
    (expr
        (def
            name: (symbol)
            value: (expr
                (fn
                    params: (params
                        (param
                            name: (symbol)
                            type: (expr
                                (symbol))))
                    return_type: (expr
                        (symbol))
                    body: (block
                        (expr
                            (symbol))))))))

==================
Function definition with two params
==================

add = fn(x: i32, y: i32) -> i32 {
    x + y
}

---

(source_file
  (expr
    (def
      name: (symbol)
      value: (expr
        (fn
            params: (params
                (param
                    name: (symbol)
                    type: (expr
                        (symbol)))
                (param
                    name: (symbol)
                    type: (expr
                        (symbol))))
            return_type: (expr
                (symbol))
            body: (block
                (expr
                    (binary_op
                        left: (expr
                            (symbol))
                        right: (expr
                            (symbol))))))))))

==================
Generic function definition with one type parameter
==================

id = fn(T: type, x: T) -> T {
    x
}

---

(source_file
  (expr
    (def
        name: (symbol)
        value: (expr
            (fn
                params: (params
                    (param
                        name: (symbol)
                        type: (expr
                            (symbol)))
                    (param
                        name: (symbol)
                        type: (expr
                            (symbol))))
                return_type: (expr
                    (symbol))
                body: (block
                    (expr
                        (symbol))))))))


==================
Function call with no args
==================

main()

---

(source_file
  (expr
    (call
      name: (symbol))))

==================
Function call with one argument
==================

id(42)

---

(source_file
  (expr
    (call
      name: (symbol)
      args: (args
        (expr
          (int))))))

==================
Function call with two args
==================

add(5, 3)

---

(source_file
  (expr
    (call
      name: (symbol)
      args: (args
        (expr
          (int))
        (expr
          (int))))))
