==================
positive int
==================

42

---

(source_file
    (expression
        (int)))

==================
negative int
==================

-42

---

(source_file
  (expression
    (unary_expression
        (expression
            (int)))))

==================
positive float
==================

3.14

---

(source_file
    (expression
        (float)))

==================
negative float
==================

-3.14

---

(source_file
    (expression
        (unary_expression
            (expression
                (float)))))

==================
string
==================

"Hello, World!"

---

(source_file
    (expression
        (string)))

==================
boolean true
==================

true

---

(source_file
    (expression
        (boolean)))

==================
boolean false
==================

false

---

(source_file
    (expression
        (boolean)))

==================
nested unary
==================

--42

---

(source_file
    (expression
        (unary_expression
            (expression
                (unary_expression
                    (expression
                         (int)))))))


==================
not operator
==================

not true

---

(source_file
    (expression
        (unary_expression
            (expression
                (boolean)))))

==================
not operator with parentheses
==================

not (5 > 3)

---

(source_file
    (expression
        (unary_expression
            (expression
                (parenthesized_expression
                    (expression
                        (binary_expression
                            left: (expression
                                (int))
                            right: (expression
                                (int)))))))))

==================
nested not operator
==================

not not false

---

(source_file
    (expression
        (unary_expression
            (expression
                (unary_expression
                    (expression
                        (boolean)))))))

==================
not operator with function call
==================

not is_valid()

---

(source_file
    (expression
        (unary_expression
            (expression
                (function_call
                    name: (identifier)
                    arguments: (argument_list))))))
