==================
variable definition with explicit type
==================

name: type = value

---

(source_file
    (statement
      (variable_definition
          pattern: (pattern_expression
              (identifier))
          type: (expression
              (identifier))
          value: (expression
              (identifier)))))


==================
variable definition with inferred type
==================

name = value

---

(source_file
    (statement
      (variable_definition
          pattern: (pattern_expression
              (identifier))
          value: (expression
              (identifier)))))

==================
tuple destructuring
==================

(x, y, z) = (1, 3.14, "hello")

---

(source_file
    (statement
      (variable_definition
          pattern: (pattern_expression
              (tuple_pattern
                  (pattern_expression
                      (identifier))
                  (pattern_expression
                      (identifier))
                  (pattern_expression
                      (identifier))))
          value: (expression
              (tuple_literal
                  (expression
                      (integer_literal))
                  (expression
                      (float_literal))
                  (expression
                      (string_literal)))))))

==================
array destructuring
==================

[x, y, z] = [1, 2, 3]

---

(source_file
    (statement
      (variable_definition
          pattern: (pattern_expression
              (array_pattern
                  (pattern_expression
                      (identifier))
                  (pattern_expression
                      (identifier))
                  (pattern_expression
                      (identifier))))
          value: (expression
              (array_literal
                  (expression
                      (integer_literal))
                  (expression
                      (integer_literal))
                  (expression
                      (integer_literal)))))))
