==================
range with first..=last
==================

[1..=10]

---

(source_file
    (expr
        (range
            first: (expr
                (int))
            last: (expr
                (int)))))

==================
range expression with first,second..=last
==================

[1,3..=9]

---

(source_file
    (expr
        (range
            first: (expr
                (int))
            second: (expr
                (int))
            last: (expr
                (int)))))

==================
range expression with first..<last
==================

[1..<10]

---

(source_file
    (expr
        (range
            first: (expr
                (int))
            last: (expr
                (int)))))

==================
range expression with first,second..<last
==================

[1,3..<9]

---

(source_file
    (expr
        (range
            first: (expr
                (int))
            second: (expr
                (int))
            last: (expr
                (int)))))

==================
range expression with first..>last
==================

[10..>1]

---

(source_file
    (expr
        (range
            first: (expr
                (int))
            last: (expr
                (int)))))

==================
range expression with first,second..>last
==================

[10,8..>1]

---

(source_file
    (expr
        (range
            first: (expr
                (int))
            second: (expr
                (int))
            last: (expr
                (int)))))

==================
range expression with first..
==================

[1..]

---

(source_file
    (expr
        (range
            first: (expr
                (int)))))
