==================
range with first..last
==================

[1..10]

---

(source_file
    (statement
      (expression
          (range_expression
              first: (expression
                  (integer_literal))
              last: (expression
                  (integer_literal))))))

==================
range expression with first,second..last
==================

[1,3..9]

---

(source_file
    (statement
      (expression
          (range_expression
              first: (expression
                  (integer_literal))
              second: (expression
                  (integer_literal))
              last: (expression
                  (integer_literal))))))

==================
range expression with big..small
==================

[10..1]

---

(source_file
    (statement
      (expression
          (range_expression
              first: (expression
                  (integer_literal))
              last: (expression
                  (integer_literal))))))

==================
range expression with big,second..last
==================

[10,8..1]

---

(source_file
    (statement
      (expression
          (range_expression
              first: (expression
                  (integer_literal))
              second: (expression
                  (integer_literal))
              last: (expression
                  (integer_literal))))))

==================
range expression with first..
==================

[1..]

---

(source_file
    (statement
      (expression
          (range_expression
              first: (expression
                  (integer_literal))))))

==================
range expression with first, second..
==================

[1,3..]

---

(source_file
    (statement
      (expression
          (range_expression
              first: (expression
                  (integer_literal))
              second: (expression
                  (integer_literal))))))

==================
range expression with ..last
==================

[..10]

---

(source_file
    (statement
      (expression
          (range_expression
              last: (expression
                  (integer_literal))))))

==================
range expression with ..
==================

[..]

---

(source_file
    (statement
      (expression
          (range_expression))))
