==================
Struct definition with no fields
==================

Empty = struct {}

---

(source_file
    (expr
        (def
            name: (symbol)
            value: (expr
                (struct)))))

==================
Struct definition with one field
==================

Square = struct {
    length: f32
}

---

(source_file
    (expr
        (def
            name: (symbol)
            value: (expr
                (struct
                    (fields
                        (field
                            name: (symbol)
                            type: (expr
                                (symbol)))))))))

==================
Struct definition with two fields
==================

Rectangle = struct {
    width: f32,
    height: f32
}

---

(source_file
    (expr
        (def
            name: (symbol)
            value: (expr
                (struct
                    (fields
                        (field
                            name: (symbol)
                            type: (expr
                                (symbol)))
                        (field
                            name: (symbol)
                            type: (expr
                                (symbol)))))))))


==================
Generic struct definition with two fields
==================

Slice = fn(T: type) type {
    struct {
        data: ptr(T),
        len: usize,
    }
}

---

(source_file
    (expr
        (def
            name: (symbol)
            value: (expr
                (fn
                    params: (params
                        (param
                            name: (symbol)
                            type: (expr
                                (symbol))))
                    return_type: (expr
                        (symbol))
                    body: (block
                        (expr
                        (struct
                            (fields
                                (field
                                    name: (symbol)
                                    type: (expr
                                        (call
                                            fn: (expr
                                                (symbol))
                                            args: (args
                                                (expr
                                                    (symbol))))))
                                (field
                                    name: (symbol)
                                    type: (expr
                                        (symbol))))))))))))
