==================
Struct definition with no fields
==================

Empty = struct {}

---

(source_file
    (statement
        (variable_definition
            pattern: (pattern_expression
                (identifier))
            value: (expression
                (struct_definition)))))

==================
Struct definition with one field
==================

Square = struct {
    length: f32
}

---

(source_file
    (statement
        (variable_definition
            pattern: (pattern_expression (identifier))
            value: (expression
                (struct_definition
                    (struct_fields
                        (struct_field
                            name: (identifier)
                            type: (expression
                                (identifier)))))))))

==================
Struct definition with two fields
==================

Rectangle = struct {
    width: f32,
    height: f32
}

---

(source_file
    (statement
        (variable_definition
            pattern: (pattern_expression (identifier))
            value: (expression
                (struct_definition
                    (struct_fields
                        (struct_field
                            name: (identifier)
                            type: (expression
                                (identifier)))
                        (struct_field
                            name: (identifier)
                            type: (expression
                                (identifier)))))))))


==================
Struct definition with trailing comma
==================

Rectangle = struct {
    width: f32,
    height: f32,
}

---

(source_file
    (statement
        (variable_definition
            pattern: (pattern_expression (identifier))
            value: (expression
                (struct_definition
                    (struct_fields
                        (struct_field
                            name: (identifier)
                            type: (expression
                                (identifier)))
                        (struct_field
                            name: (identifier)
                            type: (expression
                                (identifier)))))))))

==================
Generic struct definition with two fields
==================

Slice = fn(T: type) type {
    struct {
        data: *T,
        len: usize,
    }
}

---

(source_file
    (statement
        (variable_definition
            pattern: (pattern_expression
              (identifier))
            value: (expression
                (function_definition
                    parameters: (function_parameters
                        (function_parameter
                            pattern: (pattern_expression (identifier))
                            type: (expression
                                (identifier))))
                    return_type: (expression
                        (identifier))
                    body: (block
                      (statement
                        (expression
                          (struct_definition
                              (struct_fields
                                  (struct_field
                                      name: (identifier)
                                      type: (expression
                                          (unary_operation
                                              (expression
                                                  (identifier)))))
                                  (struct_field
                                      name: (identifier)
                                      type: (expression
                                          (identifier)))))))))))))
